; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v4 ?v13)
             (pred_4 ?v5 ?v2)
             (pred_3 ?v4 ?v2)
             (pred_12 ?v6 ?v4 )
	     (pred_9 ?v4)
             (pred_2 ?v3)
             (pred_10 ?v5)
             (pred_6 ?v2)
             (pred_5 ?v4)
             (pred_8 ?v5)
             (pred_11 ?v4)
             (pred_7 ))



(:action op_4
:parameters (?v11 ?v7 ?v8 ?v1)
:precondition (and (pred_2 ?v11) (pred_2 ?v7) (pred_10 ?v8) (pred_6 ?v1)
          (pred_1 ?v11 ?v7) (pred_4 ?v8 ?v1)
                   (pred_3 ?v7 ?v1) (pred_9 ?v11) 
                   (pred_5 ?v7) (pred_8 ?v8))
:effect (and  (pred_11 ?v7) (not (pred_5 ?v7))))


(:action op_1
:parameters (?v11 ?v10)
:precondition (and (pred_2 ?v11) (pred_2 ?v10)
               (pred_9 ?v11) (pred_1 ?v11 ?v10) (pred_11 ?v10))
:effect (and (pred_9 ?v10) (not (pred_9 ?v11))))

(:action op_3
:parameters (?v11 ?v8)
:precondition (and (pred_2 ?v11) (pred_10 ?v8) 
                  (pred_9 ?v11) (pred_12 ?v8 ?v11) (pred_7 ))
:effect (and (pred_8 ?v8)
   (not (pred_12 ?v8 ?v11)) (not (pred_7 ))))


(:action op_5
:parameters (?v11 ?v9 ?v12)
:precondition (and (pred_2 ?v11) (pred_10 ?v9) (pred_10 ?v12)
                  (pred_9 ?v11) (pred_8 ?v12) (pred_12 ?v9 ?v11))
:effect (and (pred_8 ?v9) (pred_12 ?v12 ?v11)
        (not (pred_8 ?v12)) (not (pred_12 ?v9 ?v11))))

(:action op_2
:parameters (?v11 ?v8)
:precondition (and (pred_2 ?v11) (pred_10 ?v8) 
                  (pred_9 ?v11) (pred_8 ?v8))
:effect (and (pred_7 ) (pred_12 ?v8 ?v11) (not (pred_8 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_14 obj_10 obj_20 obj_08 obj_11 obj_06 obj_05 obj_03 obj_19 obj_15 obj_04 obj_09 obj_16 obj_01 obj_13
    obj_21 obj_17
    obj_12 obj_02 obj_07
    )

    (:init
       (pred_7)

       (pred_2 obj_18)
       (pred_2 obj_14)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_03)
       (pred_2 obj_19)
       (pred_2 obj_15)
       (pred_2 obj_04)
       (pred_2 obj_09)
       (pred_2 obj_16)
       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_17)
       (pred_10 obj_12)
       (pred_10 obj_02)
       (pred_10 obj_07)

       (pred_1 obj_18 obj_08)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_14 obj_11)
       (pred_1 obj_14 obj_10)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_10 obj_20)
       (pred_1 obj_10 obj_14)
       (pred_1 obj_20 obj_05)
       (pred_1 obj_20 obj_10)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_11 obj_19)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_11 obj_14)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_06 obj_15)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_05 obj_20)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_03 obj_09)
       (pred_1 obj_03 obj_19)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_19 obj_16)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_19 obj_11)
       (pred_1 obj_19 obj_03)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_15 obj_04)
       (pred_1 obj_15 obj_06)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_04 obj_15)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_16 obj_01)
       (pred_1 obj_16 obj_19)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_01 obj_16)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_13 obj_01)
       (pred_5 obj_13)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_3  obj_13 obj_21)
       (pred_3  obj_14 obj_17)
       (pred_3  obj_08 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_11)
       (pred_11 obj_06)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_01)

       (pred_4  obj_12 obj_21)
       (pred_4  obj_02 obj_17)
       (pred_4  obj_07 obj_21)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_07 obj_03)
       (pred_9 obj_01)
    )

    (:goal (and
       (pred_12 obj_12 obj_15)
    ))
(:constraints
  (always (not (pred_9 obj_06)))
)
)

; plan
1. (op_1 obj_01 obj_15)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_15)
   goals met: 0 of 1
2. (op_1 obj_15 obj_19)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_19)
   goals met: 0 of 1
3. (op_1 obj_19 obj_11)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_11)
   goals met: 0 of 1
4. (op_3 obj_11 obj_12)
   deleted: (pred_12 obj_12 obj_11) (pred_7)
   added: (pred_8 obj_12)
   goals met: 0 of 1
5. (op_1 obj_11 obj_19)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_19)
   goals met: 0 of 1
6. (op_1 obj_19 obj_15)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_15)
   goals met: 0 of 1
7. (op_2 obj_15 obj_12)
   deleted: (pred_8 obj_12)
   added: (pred_7) (pred_12 obj_12 obj_15)
   goals met: 1 of 1
